# Initial Movie Data Exploration


### Loading the Data with Pandas


* Import and alias `pandas` as `pd`
* Import and alias `numpy` as `np`
* Import and alias `seaborn` as `sns`
* Import and alias `matplotlib.pyplot` as `plt`
* Set Matplotlib visualizations to display inline in the notebook

In [95]:
import csv
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

### Exploring zippedData

In [96]:
!ls zippedData/

bom.movie_gross.csv.gz       imdb.title.ratings.csv.gz
imdb.name.basics.csv.gz      rt.movie_info.tsv.gz
imdb.title.akas.csv.gz       rt.reviews.tsv.gz
imdb.title.basics.csv.gz     tmdb.movies.csv.gz
imdb.title.crew.csv.gz       tn.movie_budgets.csv.gz
imdb.title.principals.csv.gz

It looks like the zippedData folder contains `csv.gz` and `tsv.gz` files

In [97]:
# Load 'bom.movie_gross.csv.gz' file with pd.read_csv as bom_df :

bom_df = pd.read_csv('zippedData/bom.movie_gross.csv.gz')

# Explore the first 5 rows

bom_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

### Getting more information about our dataFrame

In [98]:
bom_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [99]:
bom_df.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [100]:
# Samples of missing values domestic_gross:

bom_df[bom_df['domestic_gross'].isna()].sample(5, random_state=1)

                             title studio  domestic_gross foreign_gross  year
2392           Finding Mr. Right 2     CL             NaN     114700000  2016
1342  All the Boys Love Mandy Lane   RTWC             NaN       1900000  2013
1659                    Jessabelle    LGF             NaN       7000000  2014
1681                     14 Blades   RTWC             NaN       3800000  2014
1268                    22 Bullets  Cdgm.             NaN      21300000  2013

In [101]:
# Samples of missing values foreign_gross: 

bom_df[bom_df['foreign_gross'].isna()].sample(5, random_state=1)

,title,studio,domestic_gross,foreign_gross,year
2113,Gett: The Trial of Viviane Amsalem,MBox,988000.0,NaN,2015
2190,Samba,BG,152000.0,NaN,2015
1754,Frank,Magn.,645000.0,NaN,2014
1859,Empty Hours,Strand,8200.0,NaN,2014
2523,Swiss Army Man,A24,4200000.0,NaN,2016

- From sample we can see there is some missing data from the foreign_gross column and it is type `object` 
- We can also detect missing values using `.isna()` and count them using `.value_counts()`

In [102]:
# Checking for the sum of missing values foreign_gross
bom_df['foreign_gross'].isna().value_counts()

False    2037
True     1350
Name: foreign_gross, dtype: int64

In [103]:
# Checking for the sum of missing values domestic_gross
bom_df['domestic_gross'].isna().value_counts()

False    3359
True       28
Name: domestic_gross, dtype: int64

Looks like `foreign_gross` has a lot more missing values than `domestic_gross`

In [104]:
# Replacing ',' with ''
bom_df['foreign_gross'] = bom_df['foreign_gross'].str.replace(',', '')

In [105]:
bom_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [106]:
#Turning foreign_gross column to float
bom_df['foreign_gross'] = bom_df['foreign_gross'].astype(str).astype(float)

In [107]:
bom_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   float64
 4   year            3387 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 132.4+ KB

### Droping records that have null values and checking values

# Update: 
We are not dropping values from bom bc we will use them for Budge_df

In [108]:
# in the 'foreign_gross' and 'domestic_gross' columns

# bom_df.dropna(axis = 0 ,subset=['foreign_gross'], inplace = True)
# bom_df.dropna(axis = 0 ,subset=['domestic_gross'], inplace = True)

In [110]:
#Check for any NaN values in the dom_df
bom_df.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

- Sort values highest to lowest $$$

In [111]:
Top_Foreign_Gross = bom_df.sort_values(by = ['foreign_gross'], ascending= False )
Top_Foreign_Gross[:10]

,title,studio,domestic_gross,foreign_gross,year
328,Harry Potter and the Deathly Hallows Part 2,WB,381000000.0,960500000.0,2011
1875,Avengers: Age of Ultron,BV,459000000.0,946400000.0,2015
727,Marvel's The Avengers,BV,623400000.0,895500000.0,2012
3081,Jurassic World: Fallen Kingdom,Uni.,417700000.0,891800000.0,2018
1127,Frozen,BV,400700000.0,875700000.0,2013
2764,Wolf Warrior 2,HC,2700000.0,867600000.0,2017
1477,Transformers: Age of Extinction,Par.,245400000.0,858600000.0,2014
1876,Minions,Uni.,336000000.0,823400000.0,2015
3083,Aquaman,WB,335100000.0,812700000.0,2018
1128,Iron Man 3,BV,409000000.0,805800000.0,2013

In [112]:
Top_Domestic_Gross = bom_df.sort_values(by = ['domestic_gross'], ascending= False )
Top_Domestic_Gross[:10]

                             title studio  domestic_gross  foreign_gross  year
1872  Star Wars: The Force Awakens     BV     936700000.0         1131.6  2015
3080                 Black Panther     BV     700100000.0    646900000.0  2018
3079        Avengers: Infinity War     BV     678800000.0         1369.5  2018
1873                Jurassic World   Uni.     652300000.0         1019.4  2015
727          Marvel's The Avengers     BV     623400000.0    895500000.0  2012
2758      Star Wars: The Last Jedi     BV     620200000.0    712400000.0  2017
3082                 Incredibles 2     BV     608600000.0    634200000.0  2018
2323  Rogue One: A Star Wars Story     BV     532200000.0    523900000.0  2016
2759   Beauty and the Beast (2017)     BV     504000000.0    759500000.0  2017
2324                  Finding Dory     BV     486300000.0    542300000.0  2016

In [113]:
bom_df.describe()

       domestic_gross  foreign_gross         year
count    3.359000e+03   2.037000e+03  3387.000000
mean     2.874585e+07   7.487281e+07  2013.958075
std      6.698250e+07   1.374106e+08     2.478141
min      1.000000e+02   6.000000e+02  2010.000000
25%      1.200000e+05   3.700000e+06  2012.000000
50%      1.400000e+06   1.870000e+07  2014.000000
75%      2.790000e+07   7.490000e+07  2016.000000
max      9.367000e+08   9.605000e+08  2018.000000

In [114]:
bom_df['studio'].describe()

count     3382
unique     257
top        IFC
freq       166
Name: studio, dtype: object

In [115]:
# Looking for missing records in studio 
bom_df.loc[bom_df['studio'].isna() == True]

,title,studio,domestic_gross,foreign_gross,year
210,Outside the Law (Hors-la-loi),NaN,96900.0,3300000.0,2010
555,Fireflies in the Garden,NaN,70600.0,3300000.0,2011
933,Keith Lemon: The Film,NaN,NaN,4000000.0,2012
1862,Plot for Peace,NaN,7100.0,NaN,2014
2825,Secret Superstar,NaN,NaN,122000000.0,2017

In [116]:
# Replacing NaN for 'Unknown' and checking

bom_df['studio'] = bom_df['studio'].fillna('Unknown')
bom_df.isna().sum()

title                0
studio               0
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [22]:
# bom_df.groupby(['domestic_gross'])['foreign_gross'].sum().sort_values().plot(kind='barh', figsize=(15,8))
#haha this graph dont !

# Movie_budgets from here

### Aggregating and Combining DataFrames

- Bringing the two datasets together into one and aligning the rows based on the common attributes or columns

In [ ]:
#adding tn.movie_budgets.csv.gz

In [117]:
budge_df = pd.read_csv('zippedData/tn.movie_budgets.csv.gz')
budge_df

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [118]:
#Looking for missing values
budge_df.isna().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [119]:
#we want the last 4 letters of each object in budge_df['release_date']

budge_df['release_date'][0][-4:]

'2009'

In [120]:
#New column named 'year' lambda function to iterate each budge_df['release_date']
budge_df['year'] = budge_df['release_date'].apply(lambda x: x[-4:] )

In [121]:
#print budge_df['year']
budge_df['year']

0       2009
1       2011
2       2019
3       2015
4       2017
        ...
5777    2018
5778    1999
5779    2005
5780    2015
5781    2005
Name: year, Length: 5782, dtype: object

- Getting rid of the beatiful $ sign in production_budget

In [122]:
budge_df['production_budget'] = budge_df['production_budget'].str.replace('$', '')
budge_df['production_budget']

0       425,000,000
1       410,600,000
2       350,000,000
3       330,600,000
4       317,000,000
           ...
5777          7,000
5778          6,000
5779          5,000
5780          1,400
5781          1,100
Name: production_budget, Length: 5782, dtype: object

- Getting rid of the beatiful $ sign in domestic_gross

In [123]:
budge_df['domestic_gross'] = budge_df['domestic_gross'].str.replace('$', '')
budge_df['domestic_gross']

0       760,507,625
1       241,063,875
2        42,762,350
3       459,005,868
4       620,181,382
           ...
5777              0
5778         48,482
5779          1,338
5780              0
5781        181,041
Name: domestic_gross, Length: 5782, dtype: object

- Getting rid of the beatiful $ sign in worldwide_gross

In [124]:
budge_df['worldwide_gross'] = budge_df['worldwide_gross'].str.replace('$', '')
budge_df['worldwide_gross']

0       2,776,345,279
1       1,045,663,875
2         149,762,350
3       1,403,013,963
4       1,316,721,747
            ...
5777                0
5778          240,495
5779            1,338
5780                0
5781          181,041
Name: worldwide_gross, Length: 5782, dtype: object

# Converting type object  to float

- Needs to be investigated: why is it not letting it to convert to float. 
- Notice the , (commas) we need to get rid of those
- Use replace(',', '_') for easy to read

In [125]:
budge_df['production_budget'] = budge_df['production_budget'].str.replace(',', '_')
budge_df['production_budget']

0       425_000_000
1       410_600_000
2       350_000_000
3       330_600_000
4       317_000_000
           ...
5777          7_000
5778          6_000
5779          5_000
5780          1_400
5781          1_100
Name: production_budget, Length: 5782, dtype: object

In [126]:
budge_df['domestic_gross'] = budge_df['domestic_gross'].str.replace(',', '_')
budge_df['domestic_gross']

0       760_507_625
1       241_063_875
2        42_762_350
3       459_005_868
4       620_181_382
           ...
5777              0
5778         48_482
5779          1_338
5780              0
5781        181_041
Name: domestic_gross, Length: 5782, dtype: object

In [127]:
budge_df['worldwide_gross'] = budge_df['worldwide_gross'].str.replace(',', '_')
budge_df['worldwide_gross']

0       2_776_345_279
1       1_045_663_875
2         149_762_350
3       1_403_013_963
4       1_316_721_747
            ...
5777                0
5778          240_495
5779            1_338
5780                0
5781          181_041
Name: worldwide_gross, Length: 5782, dtype: object

### - Now we can convert data type object to float

In [128]:
budge_df['worldwide_gross'] = budge_df['worldwide_gross'].astype(str).astype(float)
budge_df['worldwide_gross']

0       2.776345e+09
1       1.045664e+09
2       1.497624e+08
3       1.403014e+09
4       1.316722e+09
            ...
5777    0.000000e+00
5778    2.404950e+05
5779    1.338000e+03
5780    0.000000e+00
5781    1.810410e+05
Name: worldwide_gross, Length: 5782, dtype: float64

In [129]:
budge_df['domestic_gross'] = budge_df['domestic_gross'].astype(str).astype(float)
budge_df['domestic_gross']

0       760507625.0
1       241063875.0
2        42762350.0
3       459005868.0
4       620181382.0
           ...
5777            0.0
5778        48482.0
5779         1338.0
5780            0.0
5781       181041.0
Name: domestic_gross, Length: 5782, dtype: float64

In [130]:
budge_df['production_budget'] = budge_df['production_budget'].astype(str).astype(float)
budge_df['production_budget']

0       425000000.0
1       410600000.0
2       350000000.0
3       330600000.0
4       317000000.0
           ...
5777         7000.0
5778         6000.0
5779         5000.0
5780         1400.0
5781         1100.0
Name: production_budget, Length: 5782, dtype: float64

# To Do:
- Notice budge_df['worldwide_gross'] number have exp

Ok now we can merge to add `studio` from `bom_df` to `budge_df`

# averagerating looks promising

In [20]:
title_ratings = pd.read_csv('zippedData/imdb.title.ratings.csv.gz')
title_ratings

           tconst  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [19]:
!ls zippedData/

bom.movie_gross.csv.gz       imdb.title.ratings.csv.gz
imdb.name.basics.csv.gz      rt.movie_info.tsv.gz
imdb.title.akas.csv.gz       rt.reviews.tsv.gz
imdb.title.basics.csv.gz     tmdb.movies.csv.gz
imdb.title.crew.csv.gz       tn.movie_budgets.csv.gz
imdb.title.principals.csv.gz

In [14]:
name_basics_df = pd.read_csv('zippedData/imdb.name.basics.csv.gz')

In [70]:
title_basics =  pd.read_csv('zippedData/imdb.title.basics.csv.gz')

In [17]:
title_crew = pd.read_csv('zippedData/imdb.title.crew.csv.gz')

In [72]:
title_principals = pd.read_csv('zippedData/imdb.title.principals.csv.gz')

In [73]:
movie_info = pd.read_csv('zippedData/rt.movie_info.tsv.gz', sep='\t', encoding='latin-1')

In [22]:
rt_rev = pd.read_csv('zippedData/rt.reviews.tsv.gz', sep='\t', encoding='latin-1')